print('''
*******************************************************************************
          |                   |                  |                     |
 _________|________________.=""_;=.______________|_____________________|_______
|                   |  ,-"_,=""     `"=.|                  |
|___________________|__"=._o`"-._        `"=.______________|___________________
          |                `"=._o`"=._      _`"=._                     |
 _________|_____________________:=._o "=._."_.-="'"=.__________________|_______
|                   |    __.--" , ; `"=._o." ,-"""-._ ".   |
|___________________|_._"  ,. .` ` `` ,  `"-._"-._   ". '__|___________________
          |           |o`"=._` , "` `; .". ,  "-._"-._; ;              |
 _________|___________| ;`-.o`"=._; ." ` '`."\` . "-._ /_______________|_______
|                   | |o;    `"-.o`"=._``  '` " ,__.--o;   |
|___________________|_| ;     (#) `-.o `"=.`_.--"_o.-; ;___|___________________
____/______/______/___|o;._    "      `".o|o_.--"    ;o;____/______/______/____
/______/______/______/_"=._o--._        ; | ;        ; ;/______/______/______/_
____/______/______/______/__"=._o--._   ;o|o;     _._;o;____/______/______/____
/______/______/______/______/____"=._o._; | ;_.--"o.--"_/______/______/______/_
____/______/______/______/______/_____"=.o|o_.--""___/______/______/______/____
/______/______/______/______/______/______/______/______/______/______/_____ /
*******************************************************************************
''')
print("Bem vindo a ilha do tesouro.")
print("Sua missão é achar o tesouro.")

choice1 = input("Você chegou em uma estrada, escolha entre seguir o lado 'esquerdo' ou 'direito': ").lower()
if choice1 == "direito":
    choice2 = input("Você chegou a um lago, escolha entre 'nadar' ou 'barco': ").lower()
    if choice2 == "barco":
        choice3 = input("Você alcançou o castelo, escolha entre porta 'azul', 'vermelha' ou 'verde': ").lower()
        if choice3 == "vermelha":
            print("Parabens, voce encontrou o tesouro !")
        elif choice3 == "azul" or "verde":
            print("Game over")
        else:
            print("Escolha inexistente")
    elif choice2 == "nadar":
        print("Game over")
    else:
        print("Escolha inexistente")
elif choice1 == "esquerdo":
    print("Game over")
else:
    print("Escolha inexistente")